ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>The USART Divisor Latch LSB Register, along with the DLM register, determines the baud rate of the USART.</description>
            <name>DLLSB</name>
          </field>
        </fields>
        <name>DLL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>The USART Divisor Latch MSB Register, along with the DLL register, determines the baud rate of the USART.</description>
            <name>DLMSB</name>
          </field>
        </fields>
        <name>DLM</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential USART interrupts. (DLAB=0)</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>RBR Interrupt Enable. Enables the Receive Data Available interrupt. It also controls the Character Receive Time-out interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the RDA interrupt.</description>
                <name>DISABLE_THE_RDA_INTE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the RDA interrupt.</description>
                <name>ENABLE_THE_RDA_INTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RBRINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>THRE Interrupt Enable. Enables the THRE interrupt. The status of this interrupt can be read from LSR[5].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the THRE interrupt.</description>
                <name>DISABLE_THE_THRE_INT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the THRE interrupt.</description>
                <name>ENABLE_THE_THRE_INTE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>THREINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the Receive Line Status interrupt. The status of this interrupt can be read from LSR[4:1].</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the RLS interrupt.</description>
                <name>DISABLE_THE_RLS_INTE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the RLS interrupt.</description>
                <name>ENABLE_THE_RLS_INTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RLSINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the Modem Status interrupt. The components of this interrupt can be read from the MSR.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable the MS interrupt.</description>
                <name>DISABLE_THE_MS_INTER</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable the MS interrupt.</description>
                <name>ENABLE_THE_MS_INTERR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MSINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the end of auto-baud interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable end of auto-baud Interrupt.</description>
                <name>DISABLE_END_OF_AUTO_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable end of auto-baud Interrupt.</description>
                <name>ENABLE_END_OF_AUTO_B</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABEOINTEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the auto-baud time-out interrupt.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable auto-baud time-out Interrupt.</description>
                <name>DISABLE_AUTO_BAUD_TI</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable auto-baud time-out Interrupt.</description>
                <name>ENABLE_AUTO_BAUD_TIM</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABTOINTEN</name>
          </field>
        </fields>
        <name>IER</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
