ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x18</addressOffset>
        <description>Modem Status Register.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Delta CTS. Set upon state change of input CTS. Cleared on an MSR read.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No change detected on modem input, CTS.</description>
                <name>NO_CHANGE_DETECTED_O</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>State change detected on modem input, CTS.</description>
                <name>STATE_CHANGE_DETECTE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DCTS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Delta DSR. Set upon state change of input DSR. Cleared on an MSR read.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No change detected on modem input, DSR.</description>
                <name>NO_CHANGE_DETECTED_O</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>State change detected on modem input, DSR.</description>
                <name>STATE_CHANGE_DETECTE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DDSR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Trailing Edge RI. Set upon low to high transition of input RI. Cleared on an MSR read.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No change detected on modem input, RI.</description>
                <name>NO_CHANGE_DETECTED_O</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Low-to-high transition detected on RI.</description>
                <name>LOW_TO_HIGH_TRANSITI</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TERI</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Delta DCD. Set upon state change of input DCD. Cleared on an MSR read.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No change detected on modem input, DCD.</description>
                <name>NO_CHANGE_DETECTED_O</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>State change detected on modem input, DCD.</description>
                <name>STATE_CHANGE_DETECTE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DDCD</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear To Send State. Complement of input signal CTS. This bit is connected to MCR[1] in modem loopback mode.</description>
            <name>CTS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Data Set Ready State. Complement of input signal DSR. This bit is connected to MCR[0] in modem loopback mode.</description>
            <name>DSR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Ring Indicator State. Complement of input RI. This bit is connected to MCR[2] in modem loopback mode.</description>
            <name>RI</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Data Carrier Detect State. Complement of input DCD. This bit is connected to MCR[3] in modem loopback mode.</description>
            <name>DCD</name>
          </field>
        </fields>
        <name>MSR</name>
        <readAction>modify</readAction>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1C</addressOffset>
        <description>Scratch Pad Register. Eight-bit temporary storage for software.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>A readable, writable byte.</description>
            <name>PAD</name>
          </field>
        </fields>
        <name>SCR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>Auto-baud Control Register. Contains controls for the auto-baud feature.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>This bit is automatically cleared after auto-baud completion.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Auto-baud stop (auto-baud is not running).</description>
                <name>AUTO_BAUD_STOP_AUTO</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Auto-baud start (auto-baud is running). Auto-baud run bit. This bit is automatically cleared after auto-baud completion.</description>
                <name>AUTO_BAUD_START_AUT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>START</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Auto-baud mode select bit.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Mode 0.</description>
                <name>MODE_0_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Mode 1.</description>
                <name>MODE_1_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MODE</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Start mode</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No restart</description>
                <name>NO_RESTART</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Restart in case of time-out (counter restarts at next USART Rx falling edge)</description>
                <name>RESTART_IN_CASE_OF_T</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>AUTORESTART</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>End of auto-baud interrupt clear bit (write only accessible).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a 0 has no impact.</description>
                <name>NO_IMPACT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABEOINTCLR</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Auto-baud time-out interrupt clear bit (write only accessible).</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a 0 has no impact.</description>
                <name>NO_IMPACT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Writing a 1 will clear the corresponding interrupt in the IIR.</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ABTOINTCLR</name>
          </field>
        </fields>
        <name>ACR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
