ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4C</addressOffset>
        <description>RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>NMM enable.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is disabled.</description>
                <name>DISABLED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>RS-485/EIA-485 Normal Multidrop Mode (NMM) is enabled. In this mode, an address is detected when a received byte causes the USART to set the parity error and generate an interrupt.</description>
                <name>ENABLED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>NMMEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Receiver enable.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>The receiver is enabled.</description>
                <name>THE_RECEIVER_IS_ENAB</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>The receiver is disabled.</description>
                <name>THE_RECEIVER_IS_DISA</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>RXDIS</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>AAD enable.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Auto Address Detect (AAD) is disabled.</description>
                <name>AUTO_ADDRESS_DETECT_</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Auto Address Detect (AAD) is enabled.</description>
                <name>AUTO_ADDRESS_DETECT_</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>AADEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Select direction control pin</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>If direction control is enabled (bit DCTRL = 1), pin RTS is used for direction control.</description>
                <name>RTS</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>If direction control is enabled (bit DCTRL = 1), pin DTR is used for direction control.</description>
                <name>DTR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Auto direction control enable.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disable Auto Direction Control.</description>
                <name>DISABLE_AUTO_DIRECTI</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enable Auto Direction Control.</description>
                <name>ENABLE_AUTO_DIRECTIO</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>DCTRL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Polarity control. This bit reverses the polarity of the direction control signal on the RTS (or DTR) pin.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>The direction control pin will be driven to logic 0 when the transmitter has data to be sent. It will be driven to logic 1 after the last bit of data has been transmitted.</description>
                <name>LOW</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>The direction control pin will be driven to logic 1 when the transmitter has data to be sent. It will be driven to logic 0 after the last bit of data has been transmitted.</description>
                <name>HIGH</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>OINV</name>
          </field>
        </fields>
        <name>RS485CTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x50</addressOffset>
        <description>RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Contains the address match value.</description>
            <name>ADRMATCH</name>
          </field>
        </fields>
        <name>RS485ADRMATCH</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
