ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x3C</addressOffset>
        <description>External Match Register. The EMR controls the match function and the external match pins CT16B0_MAT[1:0] and CT16B1_MAT[1:0].</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>External Match 0. This bit reflects the state of output CT16B0_MAT0/CT16B1_MAT0, whether or not this output is connected to its pin. When a match occurs between the TC and MR0, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[5:4] control the functionality of this output. This bit is driven to the CT16B0_MAT0/CT16B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
            <name>EM0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>External Match 1. This bit reflects the state of output CT16B0_MAT1/CT16B1_MAT1, whether or not this output is connected to its pin. When a match occurs between the TC and MR1, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[7:6] control the functionality of this output. This bit is driven to the CT16B0_MAT0/CT16B1_MAT0 pins if the match function is selected in the IOCON registers (0 = LOW, 1 = HIGH).</description>
            <name>EM1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>External Match 2. This bit reflects the state of match channel 2. When a match occurs between the TC and MR2, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[9:8] control the functionality of this output.</description>
            <name>EM2</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>External Match 3. This bit reflects the state of output of match channel 3. When a match occurs between the TC and MR3, this bit can either toggle, go LOW, go HIGH, or do nothing. Bits EMR[11:10] control the functionality of this output.</description>
            <name>EM3</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>External Match Control 0. Determines the functionality of External Match 0. Table 267 shows the encoding of these bits.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Do Nothing.</description>
                <name>NOP</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear. Clear the
                corresponding External Match bit/output to 0 (CT16Bn_MAT0 pin is
                LOW if pinned out).</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set. Set the corresponding External Match bit/output to 1
                (CT16Bn_MAT0 pin is HIGH if pinned out).</description>
                <name>SET</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Toggle. Toggle the corresponding
                External Match bit/output.</description>
                <name>TOGGLE</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EMC0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>External Match Control 1. Determines the functionality of External Match 1.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Do Nothing.</description>
                <name>NOP</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear. Clear the
                corresponding External Match bit/output to 0 (CT16Bn_MAT0 pin is
                LOW if pinned out).</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set. Set the corresponding External Match bit/output to 1
                (CT16Bn_MAT0 pin is HIGH if pinned out).</description>
                <name>SET</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Toggle. Toggle the corresponding
                External Match bit/output.</description>
                <name>TOGGLE</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EMC1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>External Match Control 2. Determines the functionality of External Match 2.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Do Nothing.</description>
                <name>NOP</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear. Clear the
                corresponding External Match bit/output to 0 (CT16Bn_MAT0 pin is
                LOW if pinned out).</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set. Set the corresponding External Match bit/output to 1
                (CT16Bn_MAT0 pin is HIGH if pinned out).</description>
                <name>SET</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Toggle. Toggle the corresponding
                External Match bit/output.</description>
                <name>TOGGLE</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EMC2</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>External Match Control 3. Determines the functionality of External Match 3.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Do Nothing.</description>
                <name>NOP</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear. Clear the
                corresponding External Match bit/output to 0 (CT16Bn_MAT0 pin is
                LOW if pinned out).</description>
                <name>CLEAR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set. Set the corresponding External Match bit/output to 1
                (CT16Bn_MAT0 pin is HIGH if pinned out).</description>
                <name>SET</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Toggle. Toggle the corresponding
                External Match bit/output.</description>
                <name>TOGGLE</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>EMC3</name>
          </field>
        </fields>
        <name>EMR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
