ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x50</addressOffset>
        <description>A/D Low Compare Threshold Register 0 : Contains the lower threshold level for automatic threshold comparison for any channels linked to threshold pair 0.</description>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>Low threshold value against which A/D results will be compared</description>
            <name>THRLOW</name>
          </field>
        </fields>
        <name>THR0_LOW</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x54</addressOffset>
        <description>A/D Low Compare Threshold Register 1: Contains the lower threshold level for automatic threshold comparison for any channels linked to threshold pair 1.</description>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>Low threshold value against which A/D results will be compared</description>
            <name>THRLOW</name>
          </field>
        </fields>
        <name>THR1_LOW</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x58</addressOffset>
        <description>A/D High Compare Threshold Register 0: Contains the upper threshold level for automatic threshold comparison for any channels linked to threshold pair 0.</description>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>High threshold value against which A/D results will be compared</description>
            <name>THRHIGH</name>
          </field>
        </fields>
        <name>THR0_HIGH</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x5C</addressOffset>
        <description>A/D High Compare Threshold Register 1: Contains the upper threshold level for automatic threshold comparison for any channels linked to threshold pair 1.</description>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0xC</bitWidth>
            <description>High threshold value against which A/D results will be compared</description>
            <name>THRHIGH</name>
          </field>
        </fields>
        <name>THR1_HIGH</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x60</addressOffset>
        <description>A/D Channel-Threshold Select Register. Specifies which set of threshold compare registers are to be used for each channel</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 0 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 0 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH0_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 1 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 1 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH1_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 2 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 2 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH2_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 3 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 3 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH3_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 4 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 4 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH4_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 5 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 5 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH5_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 6 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 6 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH6_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 7 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 7 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH7_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 8 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 8 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH8_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 9 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 9 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH9_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 10 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 10 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH10_THRSEL</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Threshold select by channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 0. Channel 11 results will be compared against the threshold levels indicated in the THR0_LOW and THR0_HIGH registers</description>
                <name>THRESHOLD_0</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Threshold 1. Channel 11 results will be compared against the threshold levels indicated in the THR1_LOW and THR1_HIGH registers</description>
                <name>THRESHOLD_1</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>CH11_THRSEL</name>
          </field>
        </fields>
        <name>CHAN_THRSEL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
