ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <description>Trigger input select register for DMA channel 0.</description>
        <displayName>DMA_ITRIG_PINMUX[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
            <name>INP_N</name>
          </field>
        </fields>
        <name>DMA_ITRIG_PINMUX[4]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1F</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>Trigger input select register for DMA channel 0.</description>
        <displayName>DMA_ITRIG_PINMUX[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
            <name>INP_N</name>
          </field>
        </fields>
        <name>DMA_ITRIG_PINMUX[5]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1F</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x18</addressOffset>
        <description>Trigger input select register for DMA channel 0.</description>
        <displayName>DMA_ITRIG_PINMUX[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
            <name>INP_N</name>
          </field>
        </fields>
        <name>DMA_ITRIG_PINMUX[6]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1F</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1C</addressOffset>
        <description>Trigger input select register for DMA channel 0.</description>
        <displayName>DMA_ITRIG_PINMUX[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
            <name>INP_N</name>
          </field>
        </fields>
        <name>DMA_ITRIG_PINMUX[7]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1F</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x20</addressOffset>
        <description>Trigger input select register for DMA channel 0.</description>
        <displayName>DMA_ITRIG_PINMUX[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
            <name>INP_N</name>
          </field>
        </fields>
        <name>DMA_ITRIG_PINMUX[8]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1F</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x24</addressOffset>
        <description>Trigger input select register for DMA channel 0.</description>
        <displayName>DMA_ITRIG_PINMUX[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
            <name>INP_N</name>
          </field>
        </fields>
        <name>DMA_ITRIG_PINMUX[9]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1F</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Trigger input select register for DMA channel 0.</description>
        <displayName>DMA_ITRIG_PINMUX[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Trigger input number (decimal value) to DMA channel n. All other values are reserved.  0	 = ADC0_SEQA_IRQ 1 = 	ADC0_SEQB_IRQ 2	 = CT16B0_MAT0 3 = 	CT16B1_MAT0 4	 = CT32B0_MAT0 5	 = CT16B1_MAT0 6	 = PINT0 ( pin interrupt 0) 7 = 	PINT1 (pin interrupt1 ) 8 = 	SCT0_DMA0 9 = 	SCT0_DMA1 10	 = SCT1_DMA0 11	 = SCT1_DMA1</description>
            <name>INP_N</name>
          </field>
        </fields>
        <name>DMA_ITRIG_PINMUX[10]</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1F</resetValue>
      </register>
