ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <addressBlock>
      <offset>0x0</offset>
      <size>0xFFF</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40048000</baseAddress>
    <description>System configuration (SYSCON)</description>
    <groupName>SYSCON</groupName>
    <interrupts>
      <interrupt>
        <name>BOD_WDT</name>
        <value>0x1A</value>
      </interrupt>
    </interrupts>
    <name>SYSCON</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>System memory remap</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>System memory remap. Value 0x3 is reserved.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Boot Loader Mode. Interrupt vectors are re-mapped to Boot ROM.</description>
                <name>BOOT_LOADER_MODE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>User RAM Mode. Interrupt vectors are re-mapped to Static RAM.</description>
                <name>USER_RAM_MODE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>User Flash Mode. Interrupt vectors are not re-mapped and reside in Flash.</description>
                <name>USER_FLASH_MODE</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>MAP</name>
          </field>
        </fields>
        <name>SYSMEMREMAP</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>Peripheral reset control</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SSP0 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the SSP0 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. SSP0 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SSP0_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>I2C0 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the I2C0 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. I2C0 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>I2C0_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SSP1 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the SSP1 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. SSP1 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SSP1_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>I2C1 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the I2C1 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. I2C1 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>I2C1_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>FRG reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the FRG peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. FRG reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>FRG_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>USART1 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the USART1 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. USART1 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>USART1_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>USART2 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the USART2 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. USART2 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>USART2_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>USART3 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the USART3 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. USART3 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>USART3_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>USART4 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the USART4 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. USART4 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>USART4_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SCT0 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the SCT0 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. SCT0 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SCT0_RST_N</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SCT1 reset control</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reset. Resets the SCT1 peripheral.</description>
                <name>RESET</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Clear reset. SCT1 reset de-asserted.</description>
                <name>CLEAR_RESET</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SCT1_RST_N</name>
          </field>
        </fields>
        <name>PRESETCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
