ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x40</addressOffset>
        <description>System PLL clock source select</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>System PLL clock source</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>IRC</description>
                <name>IRC</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>System oscillator. Crystal Oscillator (SYSOSC)</description>
                <name>SYSTEM_OSCILLATOR</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Reserved</description>
                <name>RESERVED</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>32 kHz clock.Select this option when the 32 kHz clock is the clock source for the main clock and select the pll input in the MAINCLKSEL register. Do not use the 32 kHz clock with the PLL.</description>
                <name>32_KHZ_CLOCK</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SEL</name>
          </field>
        </fields>
        <name>SYSPLLCLKSEL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x44</addressOffset>
        <description>System PLL clock source update enable</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enable system PLL clock source update</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No change</description>
                <name>NO_CHANGE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Update clock source</description>
                <name>UPDATE_CLOCK_SOURCE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ENA</name>
          </field>
        </fields>
        <name>SYSPLLCLKUEN</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x70</addressOffset>
        <description>Main clock source select</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Clock source for main clock</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>IRC Oscillator</description>
                <name>IRC_OSCILLATOR</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PLL input</description>
                <name>PLL_INPUT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Watchdog oscillator</description>
                <name>WATCHDOG_OSCILLATOR</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>PLL output</description>
                <name>PLL_OUTPUT</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SEL</name>
          </field>
        </fields>
        <name>MAINCLKSEL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x74</addressOffset>
        <description>Main clock source update enable</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enable main clock source update</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No change</description>
                <name>NO_CHANGE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Update clock source</description>
                <name>UPDATE_CLOCK_SOURCE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ENA</name>
          </field>
        </fields>
        <name>MAINCLKUEN</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x78</addressOffset>
        <description>System clock divider</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>System AHB clock divider values  0: System clock disabled.  1: Divide by 1.  to 255: Divide by 255.</description>
            <name>DIV</name>
          </field>
        </fields>
        <name>SYSAHBCLKDIV</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
