ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4C4</addressOffset>
        <description>Control and status register for DMA channel 0.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Valid pending flag for this channel. This bit is set when a 1 is written to the corresponding bit in the related SETVALID register when CFGVALID = 1 for the same channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No effect on DMA operation.</description>
                <name>NO_EFFECT_ON_DMA_OPE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Valid pending.</description>
                <name>VALID_PENDING</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>VALIDPENDING</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Trigger flag. Indicates that the trigger for this channel is currently set. This bit is cleared at the end of an entire transfer or upon reload when CLRTRIG = 1.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Not triggered. The trigger for this DMA channel is not set. DMA operations will not be carried out.</description>
                <name>NOT_TRIGGERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Triggered. The trigger for this DMA channel is set. DMA operations will be carried out.</description>
                <name>TRIGGERED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TRIG</name>
          </field>
        </fields>
        <name>CTLSTAT12</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4D4</addressOffset>
        <description>Control and status register for DMA channel 0.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Valid pending flag for this channel. This bit is set when a 1 is written to the corresponding bit in the related SETVALID register when CFGVALID = 1 for the same channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No effect on DMA operation.</description>
                <name>NO_EFFECT_ON_DMA_OPE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Valid pending.</description>
                <name>VALID_PENDING</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>VALIDPENDING</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Trigger flag. Indicates that the trigger for this channel is currently set. This bit is cleared at the end of an entire transfer or upon reload when CLRTRIG = 1.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Not triggered. The trigger for this DMA channel is not set. DMA operations will not be carried out.</description>
                <name>NOT_TRIGGERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Triggered. The trigger for this DMA channel is set. DMA operations will be carried out.</description>
                <name>TRIGGERED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TRIG</name>
          </field>
        </fields>
        <name>CTLSTAT13</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4E4</addressOffset>
        <description>Control and status register for DMA channel 0.</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Valid pending flag for this channel. This bit is set when a 1 is written to the corresponding bit in the related SETVALID register when CFGVALID = 1 for the same channel.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>No effect on DMA operation.</description>
                <name>NO_EFFECT_ON_DMA_OPE</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Valid pending.</description>
                <name>VALID_PENDING</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>VALIDPENDING</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Trigger flag. Indicates that the trigger for this channel is currently set. This bit is cleared at the end of an entire transfer or upon reload when CLRTRIG = 1.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Not triggered. The trigger for this DMA channel is not set. DMA operations will not be carried out.</description>
                <name>NOT_TRIGGERED</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Triggered. The trigger for this DMA channel is set. DMA operations will be carried out.</description>
                <name>TRIGGERED</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>TRIG</name>
          </field>
        </fields>
        <name>CTLSTAT14</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
      </register>
