ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4C</addressOffset>
        <description>SCT match/capture registers mode register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Each bit controls one pair of match/capture registers (register 0 = bit 0, register 1 = bit 1,..., register 4 = bit 4).  0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
            <name>REGMOD_L</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x10</bitOffset>
            <bitWidth>0x5</bitWidth>
            <description>Each bit controls one pair of match/capture registers (register 0 = bit 16, register 1 = bit 17,..., register 4 = bit 20). 0 = registers operate as match registers. 1 = registers operate as capture registers.</description>
            <name>REGMOD_H</name>
          </field>
        </fields>
        <name>REGMODE</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x50</addressOffset>
        <description>SCT output register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x4</bitWidth>
            <description>Writing a 1 to bit n makes the corresponding output HIGH. 0 makes the corresponding output LOW (output 0 = bit 0, output 1 = bit 1,..., output 3 = bit 3).</description>
            <name>OUT</name>
          </field>
        </fields>
        <name>OUTPUT</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x54</addressOffset>
        <description>SCT output counter direction control register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Set/clear operation on output 0. Value 0x3 is reserved. Do not program this value.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear do not depend on any counter.</description>
                <name>SET_AND_CLEAR_DO_NOT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SETCLR0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Set/clear operation on output 1. Value 0x3 is reserved. Do not program this value.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear do not depend on any counter.</description>
                <name>SET_AND_CLEAR_DO_NOT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SETCLR1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Set/clear operation on output 2. Value 0x3 is reserved. Do not program this value.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear do not depend on any counter.</description>
                <name>SET_AND_CLEAR_DO_NOT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SETCLR2</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>Set/clear operation on output 3. Value 0x3 is reserved. Do not program this value.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear do not depend on any counter.</description>
                <name>SET_AND_CLEAR_DO_NOT</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter L or the unified counter is counting down.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Set and clear are reversed when counter H is counting down. Do not use if UNIFY = 1.</description>
                <name>SET_AND_CLEAR_ARE_RE</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SETCLR3</name>
          </field>
        </fields>
        <name>OUTPUTDIRCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
