ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xF</addressOffset>
        <description>Byte pin registers</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[15]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <description>Byte pin registers</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[16]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x11</addressOffset>
        <description>Byte pin registers</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[17]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x12</addressOffset>
        <description>Byte pin registers</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[18]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x13</addressOffset>
        <description>Byte pin registers</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[19]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x14</addressOffset>
        <description>Byte pin registers</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[20]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x15</addressOffset>
        <description>Byte pin registers</description>
        <displayName>B[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Read: state of the pin PIOm_n, regardless of direction, masking, or alternate function, except that pins configured as analog I/O always read as 0. One register for each port pin: m = port 0 to 2; n = pin 0 to 31 for port 0 and 1 and pin 0 to 11 for port 2. Write: loads the pin's output bit.</description>
            <name>PBYTE</name>
          </field>
        </fields>
        <name>B[21]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
