ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x2288</addressOffset>
        <description>Clear port</description>
        <displayName>CLR[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP00</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP01</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP02</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP03</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP04</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP05</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP06</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP07</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP08</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP09</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP010</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP011</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP012</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP013</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP014</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP015</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x10</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP016</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x11</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP017</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x12</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP018</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x13</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP019</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x14</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP020</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x15</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP021</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x16</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP022</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x17</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP023</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x18</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP024</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x19</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP025</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1A</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP026</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1B</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP027</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1C</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP028</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1D</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP029</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP030</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Clear output bits: 0 = No operation. 1 = Clear output bit.</description>
            <name>CLRP031</name>
          </field>
        </fields>
        <name>CLR[2]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
      </register>
