ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x2308</addressOffset>
        <description>Toggle port </description>
        <displayName>NOT[%s]</displayName>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP00</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP01</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP02</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP03</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP04</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP05</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP06</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP07</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP08</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP09</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP010</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP011</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP012</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP013</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP014</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP015</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x10</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP016</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x11</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP017</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x12</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP018</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x13</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP019</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x14</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP020</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x15</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP021</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x16</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP022</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x17</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP023</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x18</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP024</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x19</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP025</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1A</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP026</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1B</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP027</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1C</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP028</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1D</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP029</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1E</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP030</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1F</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Toggle output bits: 0 = no operation. 1 = Toggle output bit.</description>
            <name>NOTP031</name>
          </field>
        </fields>
        <name>NOT[2]</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
      </register>
