ItaySharon/cmsis-svd/data/NXP/LPC11E6x_v0.8.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x28</addressOffset>
        <description>Pattern match interrupt control register</description>
        <fields>
          <field>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Specifies whether the 8 pin interrupts are controlled by the pin interrupt function or by the pattern match function.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pin interrupt. Interrupts are driven in response to the standard pin interrupt function</description>
                <name>PIN_INTERRUPT_INTER</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Pattern match. Interrupts are driven in response to pattern matches.</description>
                <name>PATTERN_MATCH_INTER</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SEL_PMATCH</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Enables the RXEV output to the ARM cpu and/or to a GPIO output when the specified boolean expression evaluates to true.</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Disabled. RXEV output to the cpu is disabled.</description>
                <name>DISABLED_RXEV_OUTPU</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Enabled. RXEV output to the cpu is enabled.</description>
                <name>ENABLED_RXEV_OUTPUT</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>ENA_RXEV</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x18</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>This field displays the current state of pattern matches. A 1 in any bit of this field indicates that the corresponding product term is matched by the current state of the appropriate inputs.</description>
            <name>PMAT</name>
          </field>
        </fields>
        <name>PMCTRL</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x2C</addressOffset>
        <description>Pattern match interrupt bit-slice source register</description>
        <fields>
          <field>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 0</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects the output of pin interrupt select register 0 as the source to bit slice 0.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects the output of pin interrupt select register 1 as the source to bit slice 0.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 2. Selects the output of pin interrupt select register 2 as the source to bit slice 0.</description>
                <name>INPUT_2_SELECTS_PIN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 3. Selects the output of pin interrupt select register 3 as the source to bit slice 0.</description>
                <name>INPUT_3_SELECTS_PIN</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 4. Selects the output of pin interrupt select register 4 as the source to bit slice 0.</description>
                <name>INPUT_4_SELECTS_PIN</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 5. Selects the output of pin interrupt select register 5 as the source to bit slice 0.</description>
                <name>INPUT_5_SELECTS_PIN</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 6. Selects the output of pin interrupt select register 6 as the source to bit slice 0.</description>
                <name>INPUT_6_SELECTS_PIN</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 7. Selects the output of pin interrupt select register 7 as the source to bit slice 0.</description>
                <name>INPUT_7_SELECTS_PIN</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SRC0</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xB</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 1</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 1.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 1.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 1.</description>
                <name>INPUT_2_SELECTS_PIN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 1.</description>
                <name>INPUT_3_SELECTS_PIN</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 1.</description>
                <name>INPUT_4_SELECTS_PIN</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 1.</description>
                <name>INPUT_5_SELECTS_PIN</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 1.</description>
                <name>INPUT_6_SELECTS_PIN</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 1.</description>
                <name>INPUT_7_SELECTS_PIN</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SRC1</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 2</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 2.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 2.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 2.</description>
                <name>INPUT_2_SELECTS_PIN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 2.</description>
                <name>INPUT_3_SELECTS_PIN</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 2.</description>
                <name>INPUT_4_SELECTS_PIN</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 2.</description>
                <name>INPUT_5_SELECTS_PIN</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 2.</description>
                <name>INPUT_6_SELECTS_PIN</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 2.</description>
                <name>INPUT_7_SELECTS_PIN</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SRC2</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x11</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 3</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 3.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 3.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 3.</description>
                <name>INPUT_2_SELECTS_PIN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 3.</description>
                <name>INPUT_3_SELECTS_PIN</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 3.</description>
                <name>INPUT_4_SELECTS_PIN</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 3.</description>
                <name>INPUT_5_SELECTS_PIN</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 3.</description>
                <name>INPUT_6_SELECTS_PIN</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 3.</description>
                <name>INPUT_7_SELECTS_PIN</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SRC3</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x14</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 4</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 4.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 4.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 4.</description>
                <name>INPUT_2_SELECTS_PIN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 4.</description>
                <name>INPUT_3_SELECTS_PIN</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 4.</description>
                <name>INPUT_4_SELECTS_PIN</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 4.</description>
                <name>INPUT_5_SELECTS_PIN</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 4.</description>
                <name>INPUT_6_SELECTS_PIN</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 4.</description>
                <name>INPUT_7_SELECTS_PIN</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SRC4</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x17</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 5</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 5.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 5.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 5.</description>
                <name>INPUT_2_SELECTS_PIN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 5.</description>
                <name>INPUT_3_SELECTS_PIN</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 5.</description>
                <name>INPUT_4_SELECTS_PIN</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 5.</description>
                <name>INPUT_5_SELECTS_PIN</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 5.</description>
                <name>INPUT_6_SELECTS_PIN</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 5.</description>
                <name>INPUT_7_SELECTS_PIN</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SRC5</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1A</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 6</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 6.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 6.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 2. Selects pin interrupt input 2 as the source to bit slice 6.</description>
                <name>INPUT_2_SELECTS_PIN</name>
                <value>0x2</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 3. Selects pin interrupt input 3 as the source to bit slice 6.</description>
                <name>INPUT_3_SELECTS_PIN</name>
                <value>0x3</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 4. Selects pin interrupt input 4 as the source to bit slice 6.</description>
                <name>INPUT_4_SELECTS_PIN</name>
                <value>0x4</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 5. Selects pin interrupt input 5 as the source to bit slice 6.</description>
                <name>INPUT_5_SELECTS_PIN</name>
                <value>0x5</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 6. Selects pin interrupt input 6 as the source to bit slice 6.</description>
                <name>INPUT_6_SELECTS_PIN</name>
                <value>0x6</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 7. Selects pin interrupt input 7 as the source to bit slice 6.</description>
                <name>INPUT_7_SELECTS_PIN</name>
                <value>0x7</value>
              </enumeratedValue>
            </enumeratedValues>
            <name>SRC6</name>
          </field>
        </fields>
        <fields>
          <field>
            <bitOffset>0x1D</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Selects the input source for bit slice 7</description>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 0. Selects pin interrupt input 0 as the source to bit slice 7.</description>
                <name>INPUT_0_SELECTS_PIN</name>
                <value>0x0</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
                <description>Input 1. Selects pin interrupt input 1 as the source to bit slice 7.</description>
                <name>INPUT_1_SELECTS_PIN</name>
                <value>0x1</value>
              </enumeratedValue>
            </enumeratedValues>
            <enumeratedValues>
              <enumeratedValue>
